import pyamf
from pyamf.flex import messaging
import uuid
import requests
import datetime
from pyamf import remoting
from pyamf.flex import messaging
from pyquery import PyQuery as pq
from contextlib import closing

from t3c.manager.db import DB


class ParseFlash(object):
   """docstring for ParseFlash"""

   def __init__(self):
      super(ParseFlash, self).__init__()
      self.session = requests.Session()

   def _amf(self, message, body, url):
      msg = messaging.RemotingMessage(operation=message[0],
                                      source=message[1],
                                      clientId=str(uuid.uuid4()).lower(),
                                      timestamp=0,
                                      timeToLive=0,
                                      destination=message[2],
                                      messageId=str(uuid.uuid4()).upper()
                                      )
      msg.body = body
      msg.headers['DSEndpoint'] = 'null'
      msg.headers['DSId'] = str(uuid.uuid1()).upper()
      req = remoting.Request(target='', body=[msg])
      ev = remoting.Envelope(pyamf.AMF3)
      ev['/0'] = req
      bin_msg = remoting.encode(ev)
      resp = self.session.post(url, data=bin_msg.getvalue(),
                               headers={'Content-Type': 'application/x-amf'})
      return resp


class GetGasCommpanyData(object):
   """
    docstring for GetGasCommpanyNameAndEnterPrisedId
    获取所有排放废气的公司的名称以及prisedId
   """

   def __init__(self):
      super(GetGasCommpanyData, self).__init__()
      self.url = 'http://111.75.227.207:9180/eipp/messagebroker/amf'

   def all_gas_company_name_company_id(self):
      message = ['getEnterprisesByType', '', 'EnterpriseBasService']
      body = ['2', '1', '2017']
      resp = ParseFlash()._amf(message, body, self.url)
      if resp.ok:
         resp_msg = remoting.decode(resp.content).bodies[0][1]
         # print(resp_msg)
         gas_company_data_list = list(resp_msg.body.body)
         # print(temp_list)
         all_gas_company_name_companyId = []
         for dic in gas_company_data_list:
            gas_company_name_companyId = []
            gas_company_name_companyId.append(dic['name'])
            gas_company_name_companyId.append(str(int(dic['enterpriseId'])))
            all_gas_company_name_companyId.append(gas_company_name_companyId)
            # print('---------------------')
         return all_gas_company_name_companyId
# disOutId 获取每个厂的id以及查询污染时要用到的disOutId，以列表形式返回。

   def get_all_commpany_id_disOutId(self):
      commpany_name_id_list = self.all_gas_company_name_company_id()
      message = ['findAutoMonitorByEnterpriseId',
                 '', 'DischargeMonitorService']
      commpany_name_id_disOutId_list = commpany_name_id_list
      get_all_commpany_id_disOutId = []
      for commpany_name_id in commpany_name_id_list:
         body = [commpany_name_id[1]]
         resp = ParseFlash()._amf(message, body, self.url)
         if resp.ok:
            resp_msg = remoting.decode(resp.content).bodies[0][1]
            # print(resp_msg)
            gas_company_data_list = list(resp_msg.body.body)
            # print(temp_list)
            for dic in gas_company_data_list:
               gas_company_name_companyId = []
               commpany_name_id.append((dic['disMonitName']))
               commpany_name_id.append(str(int(dic['disOutId'])))
               # gas_company_name_companyId.append(dic['disOutId'])
               # gas_company_name_companyId.append(dic['disOutId'])
               # gas_company_name_companyId.append(dic['disOutId'])
            get_all_commpany_id_disOutId.append(commpany_name_id)
            # print('---------------------')
      return get_all_commpany_id_disOutId
all_data_list = [['江西晨鸣纸业有限责任公司(废水,废气,危险废物)', '601010008', '废水总排放口', '601010008001', '1#脱硫塔烟气排口', '601010008002', '2#脱硫塔烟气排口', '601010008004'], ['景德镇开门子陶瓷化工集团有限公司(废水,废气)', '602020002', '污水总排口', '602020002001', '废气排放口', '602020002002'], ['江西江维高科股份有限公司(废水,废气)', '602810003', '废气排放口', '602810003001', '污水总排口', '602810003002'], ['江西世龙实业股份有限公司(废水,废气)', '602810002', '废水总排放口', '602810002001', '1#锅炉脱硫塔烟囱', '602810002002', '2#锅炉脱硫塔烟囱', '602810002003'], ['萍乡萍钢安源钢铁有限公司(废水,废气)', '603010010', '2#总排', '603010010001', '1#、2#烧结机脱硫排放口', '603010010002', '3#烧结机机头', '603010010008', '1#燃气发电排气口', '603010010009', '2#燃气发电排气口', '603010010010', '3#燃气发电排气口', '603010010011', '3#转炉二次除尘', '603010010012', '3#出铁场除尘', '603010010013', '3#矿槽除尘', '603010010014', '3#烧结机机尾', '603010010015', '4#矿槽除尘', '603010010016', '2#矿槽废气排口', '603010010017', '2#出铁场废气排口', '603010010018', '4#出铁场废气排口', '603010010019', '90烧结脱硫1#进口', '603010010020', '90烧结脱硫2#进口', '603010010021', '180烧结脱硫进口', '603010010022'], ['萍乡萍钢钢铁有限公司(废水,废气)', '603130002', '2#总排口', '603130002001', '2#、3#高炉出铁场', '603130002002', '3#高炉矿槽', '603130002003', '炼钢1#、2#、3#二次除尘', '603130002010', '1#总排口', '603130002011', '4#烧结机机头', '603130002012', '燃气发电排气口', '603130002013', '4#转炉废气排口', '603130002015', '4#烧结机尾废气排口', '603130002016', '4#出铁场废气排口', '603130002017', '4#矿槽废气排口', '603130002018', '1#矿槽废气排口', '603130002020', '1#出铁场废气排口', '603130002022', '108烧结脱硫进口', '603130002023'], ['赛得利（江西）化纤有限公司(废水,废气)', '604010013', '出水口', '604010013001', '废气总排口', '604010013003', '#3锅炉炉外脱硫烟囱', '604020010001'], ['九江金源化纤有限公司(废水,废气)', '604010014', '综合污水排放口', '604010014002', '废气排放口', '604010014003'], ['中国石油化工股份有限公司九江分公司(废水,废气,危险废物)', '604010012', '出水口', '604010012001', 'CFB炉', '604010012002', '新硫磺回收排放口', '604010012004', '1#脱硫脱硝废气排口', '604010012005', '2#脱硫脱硝废气排口', '604010012006', '1#CFB脱硫排放口', '604010012007', '2#CFB脱硫排放口', '604010012008'], ['江西蓝星星火有机硅有限公司(废水,废气,危险废物)', '604250001', '2号炉', '604250001001', '5号6号炉', '604250001002', '废水总排口', '604250001003', '1#焚烧炉废气排口', '604250001004'], ['九江萍钢钢铁有限公司(废水,废气)', '604290005', '老区废水排口', '604290005001', '新区烧结脱硫塔', '604290005002', '3#高炉出铁场除尘', '604290005003', '4#高炉出铁场除尘', '604290005004', '新区废水排口', '604290005005', '老区烧结脱硫塔', '604290005006', '1#180烧结机尾除尘', '604290005009', '2#180烧结机尾除尘', '604290005010', '1#高炉矿槽除尘', '604290005011', '2#高炉矿槽除尘', '604290005012', '3#高炉矿槽除尘', '604290005013', '4#高炉矿槽除尘', '604290005014', '1#高炉出铁场除尘', '604290005015', '2#高炉出铁场除尘', '604290005016', '238烧结机尾除尘', '604290005018', '老区转炉二次除尘', '604290005019', '新区转炉二次除尘', '604290005020'], ['赛得利（九江）纤维有限公司(废水,废气)', '604290006', '出水口', '604290006001', '废气排放口', '604290006002'], ['江西铜业铅锌金属有限公司(废水,废气,重金属)', '604290007', '硫酸尾气烟囱', '604290007001', '环境集烟烟囱', '604290007002', '废水总排口', '604290007003'], ['新余钢铁集团有限公司(废水,废气)', '605010001', '360烧结机烟气排口_7号A岛', '605010001015', '360烧结机烟气排口_7号B岛', '605010001016', '360烧结机烟气排放口_6号', '605010001017', '5#烧结机脱硫出口', '605010001018', '废水总排口', '605010001019', '球团厂回转窑烟气脱硫出口', '605010001038'], ['江西六国化工有限责任公司(废水,废气)', '606810001', '热电车间', '606810001001', '废水总排放口', '606810001002'], ['江西铜业股份有限公司贵溪冶炼厂(废水,废气,重金属,危险废物)', '606810006', '二系统环境集烟烟囱', '606810006001', '二系统硫酸烟囱', '606810006002', '一系统环境集烟烟囱', '606810006004', '一系统硫酸烟囱', '606810006005', '预干燥烟囱', '606810006006', '废水总排放口', '606810006007'], ['赣州华劲纸业有限公司(废水,废气)', '607020004', '废水总排口', '607020004001', '废气排放口', '607020004002'], ['江西宏宇能源发展有限公司(废水,废气)', '609820005', '废水排放口', '609820005001', '废气排放口', '609820005002'], ['宜黄县星泰纸业有限公司(废水,废气)', '610260003', '废水总排口', '610260003001'], ['方大特钢科技股份有限公司(废气)', '601110001', '1#总排', '601110001002', '烧结机机头', '601110001003', '球团竖炉', '601110001006', '2#热电', '601110001010', '1#热电', '601110001011', '顶装焦炉', '601110001012', '捣固焦炉', '601110001013', '转炉二次除尘', '601110001014', '245烧结机尾', '601110001015', '130烧结机尾', '601110001016', '1#高炉出铁场', '601110001017', '2#高炉出铁场', '601110001018', '3#高炉出铁场', '601110001019', '245烧结脱硫排气口', '601110001021', '130烧结脱硫排气口', '601110001022'], ['中电投江西电力有限公司新昌发电分公司(废气)', '601220001', '1号废气排放口', '601220001001', '2号废气排放口', '601220001003'], ['中电投江西电力有限公司景德镇发电厂(废气)', '602030001', '1号机组净烟气排放口', '602030001001', '2号机组净烟气排放口', '602030001004'], ['江西锦溪水泥有限公司(废气)', '602810004', '废气总排口一期', '602810004001', '二期窑尾', '602810004002'], [
    '乐平市天新热电有限公司(废气)', '602810014', '废气排口', '602810014001'], ['萍乡矿业集团有限公司安源发电厂(废气)', '603020006', '废气排放口', '603020006001'], ['萍乡矿业集团有限责任公司高坑发电厂(废气)', '603020005', '总排口', '603020005001'], ['江西联达冶金有限公司(废气)', '603130001', '废气排放口', '603130001001'], ['萍乡市众邦冶金有限公司(废气)', '603130006', '脱硫排放口', '603130006001', '球团脱硫入口', '603130006002'], ['江西芦溪南方水泥有限公司(废气)', '603230001', '窑尾烟气', '603230001001'], ['九江诺贝尔陶瓷有限公司(废气)', '604020011', '废气排放口', '604020011001'], ['中国国电集团公司九江发电厂(废气)', '604010010', '九江发电厂三期5号炉', '604010010003', '九江发电厂三期6号炉', '604010010004', '九江发电厂四期7号炉', '604010010006'], ['江西三环水泥有限公司(废气)', '604260002', '废气排放口', '604260002001'], ['江西九江南方水泥有限公司(废气)', '604300001', '废气排放口', '604300001001', '1号废气排口', '604300001002'], ['江西亚东水泥有限公司(废气)', '604810001', '1#窑尾', '604810001001', '2#窑尾', '604810001002', '3#窑尾', '604810001003', '4#窑尾', '604810001004', '1#窑头', '604810001005', '2#窑头', '604810001006', '3#窑头', '604810001007', '4#窑头', '604810001008', '5#窑尾', '604810001013', '6#窑尾', '604810001014', '5#窑头冷却机', '604810001015', '6#窑头冷却机', '604810001016'], ['江西大唐国际新余发电有限责任公司(废气)', '605020003', '烟气总排口_1号机组', '605020003001', '烟气总排口_2号机组', '605020003002'], ['国家电投集团江西电力有限公司分宜发电厂(废气)', '605210002', '8号炉', '605210002002', '9号炉', '605210002003'], ['分宜海螺水泥有限责任公司(废气)', '605210003', '二线窑头', '605210003001', '二线窑尾', '605210003002', '一线窑头', '605210003003', '一线窑尾', '605210003004'], ['贵溪发电有限责任公司(废气)', '606810005', '5号机组总排口', '606810005001', '6号机组总排口', '606810005002', '2号机组总排口', '606810005004', '1号机组总排口', '606810005005'], ['华能瑞金发电有限责任公司(废气)', '607210007', '废气排放口1号', '607210007001', '废气排放口2号', '607210007002'], ['江西赣州南方万年青水泥有限公司(废气)', '607310003', '窑尾烟囱', '607310003001'], ['江西兴国南方水泥有限公司(废气)', '607320001', '废气排放口', '607320001001'], ['江西瑞金万年青水泥有限责任公司(废气)', '607810002', '废气排放口1号', '607810002001', '废气排放口2号', '607810002002'], ['华能国际电力股份有限公司井冈山电厂(废气)', '608810003', '1号机组', '608810003001', '2号机组', '608810003002', '3号炉', '608810003003', '4号炉', '608810003004'], ['中盐新干盐化有限公司(废气)', '608240001', '废气排放口', '608240001001', '污水排放口', '608240001002'], ['江西永丰南方水泥有限公司(废气)', '608250007', '废气排放口', '608250007001'], ['江西龙天勇有色金属有限公司(废气,重金属,危险废物)', '608250008', '反射炉烟气排放口', '608250008001'], ['江西泰和南方水泥有限公司(废气)', '608010001', '一线窑尾', '608010001001'], ['江西安福南方水泥有限公司(废气)', '608290003', '烟气2', '608290003002'], ['江西上高南方水泥有限公司(废气)', '609230001', '废气排放口', '609230001001'], ['国电丰城发电有限公司(废气)', '609810001', '一期1号机组', '609810001001', '一期2号机组', '609810001002', '一期3号机组', '609810001003', '一期4号机组', '609810001004'], ['江西金洋金属有限公司(废气)', '609810011', '铅锑排放口', '609810011001', '铅钙排放口', '609810011002'], ['丰城矿务局电业有限责任公司(废气)', '609810002', '废气排放口', '609810002001'], ['江西丰城南方水泥有限公司(废气)', '609810016', '窑尾废气排口', '609810016001'], ['江西省丰城新洛电业有限公司(废气)', '609810003', '废气排放口', '609810003001'], ['江西赣能股份有限公司丰城二期发电厂(废气)', '609810008', '二期5号机组', '609810008001', '二期6号机组', '609810008002'], ['江西晶昊盐化有限公司(废气)', '609820003', '1号线', '609820003001', '2号', '609820003002'], ['高安红狮水泥有限公司(废气)', '609830001', '烟气1', '609830001001', '烟气2', '609830001002'], ['大亚木业（江西）有限公司(废气)', '610020010', '旋风除尘排气筒', '610020010001', '2#废气烟囱排口', '610020010002'], ['江西大唐国际抚州发电有限公司(废气)', '610020011', '1#锅炉烟囱', '610020011001', '2#锅炉烟囱', '610020011002'], ['上饶市华丰铜业有限公司(废气,重金属)', '510000131'], ['玉山县富旺铜业有限公司(废气,重金属)', '611230006', '废气总排口', '611230006001'], ['江西玉山万年青水泥有限公司(废气)', '611230002', '1号窑排放口', '611230002001', '2号窑排放口', '611230002002'], ['横峰县南方有色金属有限公司(废气,重金属)', '611250001', '废气排放口', '611250001001'], ['横峰县中旺铜业有限公司(废气)', '611250002', '竖炉排放口', '611250002001'], ['上饶和丰铜业有限公司(废气,重金属)', '611250004'], ['弋阳海螺水泥有限公司(废气)', '611260004', '2号线窑尾', '611260004001', '1号窑尾', '611260004002'], ['国电黄金埠发电有限公司(废气)', '611270001', '1号机组排放口', '611270001001', '2号机组排放口', '611270001002'], ['江西万年青水泥股份有限公司万年水泥厂(废气)', '611290002', '2号窑排放口', '611290002001', '1号窑排放口', '611290002002', '烟气5', '611290002003', '烟气6', '611290002004'], ['江西省德兴市百勤异VC钠有限公司(废气)', '611810002', '废气总排放口', '611810002001'], ['江西理文化工有限公司(废水,废气)', '604010020', '动力车间烟囱', '604010020002', '废水排放口', '604010020003'], ['华能安源发电有限责任公司(废气)', '603010007', '新建#1机组烟囱', '603010007002', '新建#2机组烟囱', '603010007003'], ['赣州海螺水泥有限责任公司(废气)', '607220002', '窑尾废气总排口', '607220002001']]
if __name__ == '__main__':
   ni = GetGasCommpanyData()
   # l = ni.all_gas_company_name_company_id()
   # print(l)
   # print(len(l))
   l = ni.get_all_commpany_id_disOutId()
   # print(l)
   print(l)
   # for i in l:
   #    print(i)
